<?php
return [
    'custom' => [
        'n_title' => [
            'required' => 'समाचार शीर्षक फ़ील्ड आवश्यक है !!',
        ],
        'n_date' => [
            'required' => 'समाचार दिनांक फ़ील्ड आवश्यक है !!',
        ],
        'n_disc' => [
            'required' => 'समाचार विवरण फ़ील्ड आवश्यक है !!',
        ],
        'n_file' => [
            'image' => 'समाचार इमेज़ फ़ील्ड एक इमेज़ होनी चाहिए।',
            'required' => 'समाचार फीचर इमेज़ आवश्यक है !!',
            'mimes' => 'समाचार इमेज़ फ़ील्ड समर्थित फ़ाइल प्रकार: :values.',
        ],
        'title' => [
            'required' => 'ईवेंट शीर्षक फ़ील्ड आवश्यक है !!',
        ],
        'edate' => [
            'required' => 'ईवेंट दिनांक फ़ील्ड आवश्यक है !!',
        ],
        'etime' => [
            'required' => 'ईवेंट समय फ़ील्ड आवश्यक है !!',
        ],
        'place' => [
            'required' => 'इवेंट प्लेस फील्ड आवश्यक है !!',
        ],
        'e_disc' => [
            'required' => 'इवेंट विवरण फ़ील्ड आवश्यक है !!',
        ],
        'image' => [
            'required' => 'इवेंट फ़ीचर इमेज़ फ़ील्ड आवश्यक है !!',
        ],
        'name' => [
            'required' => 'नाम का फील्ड आवश्यक है !!',
        ],
        'email' => [
            'required' => 'ईमेल का फील्ड आवश्यक है !!',
        ],
        'old_password' => [
            'required' => 'पुराना पासवर्ड फ़ील्ड आवश्यक है !!',
        ],
        'password' => [
            'required' => 'पासवर्ड फ़ील्ड आवश्यक है !!',
        ],
    ],
];
