<?php
return [
    'custom' => [
        'n_title' => [
            'required' => 'समाचार शीर्षक फ़ील्ड आवश्यक है !!',
        ],
        'n_date' => [
            'required' => 'समाचार दिनांक फ़ील्ड आवश्यक है !!',
        ],
        'n_disc' => [
            'required' => 'समाचार विवरण फ़ील्ड आवश्यक है !!',
        ],
        'n_file' => [
            'required' => 'समाचार फ़ीचर छवि फ़ील्ड आवश्यक है !!',
        ],
        'title' => [
            'required' => 'ईवेंट शीर्षक फ़ील्ड आवश्यक है !!',
        ],
        'edate' => [
            'required' => 'ईवेंट दिनांक फ़ील्ड आवश्यक है !!',
        ],
        'etime' => [
            'required' => 'ईवेंट समय फ़ील्ड आवश्यक है !!',
        ],
        'place' => [
            'required' => 'इवेंट प्लेस फील्ड आवश्यक है !!',
        ],
        'e_disc' => [
            'required' => 'इवेंट विवरण फ़ील्ड आवश्यक है !!',
        ],
        'image' => [
            'required' => 'इवेंट फ़ीचर इमेज फ़ील्ड आवश्यक है !!',
        ],
    ],
];
